[
  {
    "id": 1,
    "jobTitle": "Desenvolvedora Front-End PL",
    "company": "Adventures, inc",
    "duration": "mar de 2022 - abr de 2023",
    "duracao": "1 ano 2 meses",
    "responsibilities": [
      "Desenvolver novas funcionalidades e componentes para o produto;",
      "Realizar adaptações e melhorias em recursos existentes;",
      "Acompanhar a evolução do design system e suas versões, garantindo a conformidade com as especificações;",
      "Desenvolver utilizando as tecnologias React e TypeScript;",
      "Utilizar controle de versão com Git para gerenciamento de código-fonte;",
      "Realizar migrações de projetos entre diferentes ambientes e versões."
    ],
    "skills": [
      "TypeScript",
      "Git",
      "Metodologias Agile",
      "React.js",
      "WebFlow"
    ]
  },
  {
    "id": 2,
    "jobTitle": "Desenvolvedora Front-End JR",
    "company": "Adventures, inc",
    "duration": "abr de 2021 - mar de 2022",
    "duracao": "1 ano",
    "responsibilities": [
      "Desenvolver sites com base em protótipos de UI, seguindo as especificações fornecidas pela equipe de design;",
      "Otimizar sites para melhorar o desempenho e a velocidade de carregamento;",
      "Desenvolver componentes e soluções visuais para garantir uma melhor experiência do usuário;",
      "Utilizar as tecnologias Next e Wordpress para o desenvolvimento dos projetos;",
      "Utilizar controle de versão com Git para gerenciamento do código-fonte"
    ],
    "skills": [
      "WordPress",
      "Metodologias Agile",
      "Next.js",
      "React.js",
      "Strapi"
    ]
  },
  {
    "id": 3,
    "jobTitle": "Estagiaria em Front-End",
    "company": "Visual E-commerce",
    "duration": "mar de 2020 - ago de 2020",
    "duracao": "6 meses",
    "responsibilities": [
      "Desenvolver layouts responsivos utilizando HTML, CSS e Jquery, com foco em versões mobile",
      "Desenvolver peças gráficas para campanhas de marketing, redes sociais e outros fins.",
      "Dar suporte técnico para sanar dúvidas de clientes, tanto em relação a questões técnicas quanto à utilização de produtos e serviços.",
      "Realizar testes de usabilidade e qualidade em sites e aplicativos;",
      "Participar de reuniões e treinamentos com a equipe de desenvolvimento;",
      "Contribuir com ideias e sugestões para melhorar a experiência do usuário e a qualidade dos projetos desenvolvidos."
    ],
    "skills": [
      "HTML5",
      "JavaScript",
      "CSS"
    ]
  }
]